<div style = "margin-left: auto;margin-right: auto;width: 80em;
padding-top: 50px;padding-bottom: 50px;">   

<html>
<head>
<title>
Dabeen Lee
</title>
</head>
<body>
<img src="IMG_1873.jpeg" style="float: left; width:180px; margin-right: 30px; margin-bottom: 5px;">
<pre>
</pre>
<h1>Dabeen Lee</h1>
<p>Assistant Professor, Industrial and Systems Engineering, KAIST</p>
<pre>
Office: 2109 E2-2

E-mail: dabeenl [at] kaist [dot] ac [dot] kr

Tel: +82-42-350-3113 (042-350-3113)




</pre>

<hr width="100%" />

<h3>About Me</h3>
<p>I am an assistant professor in the <a href="https://ie.kaist.ac.kr">Department of Industrial and Systems Engineering (ISysE)</a> at the <a href="https://www.kaist.ac.kr/en/">Korea Advanced Institute of Science and Technology (KAIST)</a>. Previously, I was a post-doc in the <a href="https://dimag.ibs.re.kr/">Discrete Mathematics Group</a> at the Institute for Basic Science (IBS), hosted by <a href="https://dimag.ibs.re.kr/home/sangil/">Sang-il Oum</a>, and a recipient of the <a href="https://www.ibs.re.kr/ysf/">IBS Young Scientist Fellowship (YSF)</a>.</p> 

<p>I obtained my Ph.D. in the <a href="http://aco.math.cmu.edu/">Algorithms, Combinatorics, and Optimization (ACO)</a> program at the <a href="https://www.cmu.edu/tepper/">Tepper School of Business, Carnegie Mellon University</a>, advised by <a href="http://integer.tepper.cmu.edu">G&eacute;rard Cornu&eacute;jols</a>. My thesis won the <a href="https://www.cmu.edu/tepper/news/stories/2019/may/commencement-awards-2019.html">Gerald L. Thompson Doctoral Dissertation Award</a> for the best Ph.D. thesis in the area of management Science, and I was supported by <a href="https://www.cmu.edu/tepper/programs/phd/program/student-awards.html">Henry J. Gailliot Presidential Fellowship</a>. A part of my thesis received Second Place in the <a href="https://www.informs.org/Recognizing-Excellence/Award-Recipients/Dabeen-Lee">INFORMS Optimization Society Best Student Paper Prize Competition</a> 2019.</p>

<p><b>CV</b> (<a href="Dabeen_CV.pdf">pdf</a>)</p>

<hr width="100%" />

<h3>Research Interests</h3>
<p>I am interested in a broad area of optimization spanning discrete and combinatorial optimization, stochastic, robust, and distributionally robust optimization, submodular optimization, and optimization algorithms.  Recently, I have been working on developing optimization methods for solving stochastic and data-driven decision-making problems. I am also interested in algorithms for online decision-making, such as multi-armed bandits, online scheduling, and online stochastic/convex optimization. Some of my latest projects span topics including distributionally robust chance-constrained programming, memory-efficient algorithms for submodular maximization, and learning algorithms for scheduling under uncertainty.</p>

<hr width="100%" />

<h3>Teaching</h3>
<h4>Current courses</h4>
<p><a href="https://dabeenl.github.io/IE331">IE331 OR: Optimization</a></p>
<p><a href="https://dabeenl.github.io/IE631">IE631 Integer Programming</a></p>
	<p></p>
<h4>PAST courses</h4>
<p><a href="https://dabeenl.github.io/IE539">IE539 Convex Optimization</a></p>
	
<hr width="100%" />

<h3>Preprints</h3>
<ul>
	<li>	<p> <a href="https://arxiv.org/abs/2301.11267">Online convex optimization with stochastic constraints: zero constraint violation and bandit feedback </a> with Yeongjong Kim, January 2023.</p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2210.06061">Non-smooth and H&ouml;lder-smooth submodular maximization </a> with Nam Ho-Nguyen and Duksang Lee, October 2022.</p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2105.13655">Scheduling jobs with stochastic holding costs</a> with Milan Vojnovic, September 2022. </br>
		Some preliminary results appeared in <b>NeurIPS 2021</b> (Advances in Neural Information Processing Systems) 34 (2021) 19375-19384 (<a href="https://openreview.net/pdf?id=B_jLF98u13">pdf</a>)</p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2012.14698">Conic mixed-binary sets: convex hull characterizations and applications</a> with Fatma K&#x131;l&#x131;n&ccedil;-Karzan, Simge K&uuml;&ccedil;&uuml;kyavuz, and Soroosh Shafieezadeh-Abadeh. December 2020. Revised February 2022.</br>
		Minor revision in <b>Operations Research</b>. </p></li>
   	
</ul>

<hr width="100%" />

<h3>Papers</h3>
<ul>
	<li>	<p> <a href="https://arxiv.org/abs/2007.06750">Strong formulations for distributionally robust chance-constrained programs with left-hand side uncertainty under Wasserstein ambiguity</a> with Nam Ho-Nguyen, Fatma K&#x131;l&#x131;n&ccedil;-Karzan and Simge K&uuml;&ccedil;&uuml;kyavuz.</br>
		<b>INFORMS Journal on Optimization</b>, published online (<a href="https://pubsonline.informs.org/doi/full/10.1287/ijoo.2022.0083">link</a>) </p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2012.15194">Test score algorithms for budgeted stochastic utility maximization</a> with Milan Vojnovic and Se-Young Yun. </br>
		<b>INFORMS Journal on Optimization</b>, published online (<a href="https://pubsonline.informs.org/doi/10.1287/ijoo.2022.0075">link</a>) </p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2003.12685">Distributionally robust chance-constrained programs with right-hand side uncertainty under Wasserstein ambiguity</a> with Nam Ho-Nguyen, Fatma K&#x131;l&#x131;n&ccedil;-Karzan and Simge K&uuml;&ccedil;&uuml;kyavuz. </br>
		<b>Mathematical Programming</b> 196 (2022) 641-672.  </p></li>
	<li>	<p> <a href="https://arxiv.org/abs/1910.01353">Joint chance-constrained programs and the intersection of mixing sets through a submodularity lens</a> with Fatma K&#x131;l&#x131;n&ccedil;-Karzan and Simge K&uuml;&ccedil;&uuml;kyavuz. </br>
		<b>Mathematical Programming</b> 195 (2022) 283-326. </br></li>
	<li>	<p> <a href="https://arxiv.org/abs/2007.04880">On a generalization of the Chv&aacute;tal-Gomory closure</a> with Sanjeeb Dash and Oktay G&uuml;nl&uuml;k. </br>
		<b>Mathematical Programming</b> 192 (2022) 149-175. </br>
        	Conference version: <b>IPCO 2020</b> (Integer Programming and Combinatorial Optimization), LNCS 12125 (2020) 117-129 (<a href="scg-IPCO.pdf">pdf</a>). </p></li>
	<li>	<p> <a href="https://arxiv.org/abs/2007.04880">Idealness of <em>k</em>-wise intersecting families</a> with Ahmad Abdi, G&eacute;rard Cornu&eacute;jols, and Tony Huynh. </br>
		<b>Mathematical Programming</b> 192 (2022) 29-50 (Erratum: <a href="https://link.springer.com/article/10.1007/s10107-022-01773-z">link</a>).</br>
        	Conference version: <b>IPCO 2020</b> (Integer Programming and Combinatorial Optimization), LNCS 12125 (2020) 1-12 (<a href="kwise-IPCO.pdf">pdf</a>). </p></li>
	<li>	<p> <a href="scg.pdf">Generalized Chv&aacute;tal-Gomory closures for integer programs with bounds on variables</a> with Sanjeeb Dash and Oktay G&uuml;nl&uuml;k. </br>
		<b>Mathematical Programming</b> 190 (2021) 393-425.  </p></li>
	<li>	<p> <a href="resistant.pdf">Resistant sets in the unit hypercube</a> with Ahmad Abdi and G&eacute;rard Cornu&eacute;jols.</br>
		<b>Mathematics of Operations Research</b> 46 (2021) 82-114.</p></li>
	<li>	<p> <a href="int_rest.pdf">Intersecting restrictions in clutters</a> with Ahmad Abdi and G&eacute;rard Cornu&eacute;jols. </br>
		<b>Combinatorica</b> 40 (2020) 605-623.</p></li>
	<li>	<p> <a href="cuboids.pdf">Cuboids, a class of clutters</a> with Ahmad Abdi, G&eacute;rard Cornu&eacute;jols, and Nat&aacute;lia Guri&#269;anov&aacute;.</br>
		<b>Journal of Combinatorial Theory B</b> 142 (2020) 144-209. </p></li>
 	<li>	<p> <a href="ChvatalRank1.pdf">On the rational polytopes with Chv&aacute;tal rank 1</a> with G&eacute;rard Cornu&eacute;jols and Yanjun Li. </br>
		<b>Mathematical Programming</b> 179 (2020) 21-46. </p></li>
	<li>	<p> <a href="ISBC.pdf">Identically self-blocking clutters</a> with Ahmad Abdi and G&eacute;rard Cornu&eacute;jols.</br>
		<b>IPCO 2019</b> (Integer Programming and Combinatorial Optimization), LNCS 11480 (2019) 1-12. </p></li>
	<li>	<p> <a href="EmptySplitClosure.pdf">On the NP-hardness of deciding emptiness of the split closure of a rational polytope in the 0,1 hypercube</a>. </br>
		<b>Discrete Optimization</b> 32 (2019) 11-18. </p></li>
	<li>	<p> <a href="odd_holes.pdf">Deltas, extended odd holes and their blockers</a> with Ahmad Abdi. </br>
		<b>Journal of Combinatorial Theory B</b> 136 (2019) 193-203. </p></li>
    	<li>	<p> <a href="ChvatalRank.pdf">On some polytopes contained in the 0,1 hypercube that have a small Chv&aacute;tal rank</a> with G&eacute;rard Cornu&eacute;jols. </br>
    		<b>Mathematical Programming</b> 172 (2018) 467-503. </br>
        	Conference version: <b>IPCO 2016</b> (Integer Programming and Combinatorial Optimization), LNCS 9682 (2016) 300-311 (<a href="ChvatalRankIPCO.pdf">pdf</a>). </p></li>
  
</ul>

<hr width="100%" />

<h3>Ph.D. thesis:</h3>
<ul>
<li>	<p> <a href="thesis.pdf">Cutting Planes and Integrality of Polyhedra: Structure and Complexity</a> (<a href="defense.pdf">slides</a>). </p></li>
</ul>

<hr width="100%" />

<h3>Collaborators</h3>
<p> <a href="https://personal.lse.ac.uk/abdia2/index.html">Ahmad Abdi</a>, <a href="http://integer.tepper.cmu.edu">G&eacute;rard Cornu&eacute;jols</a>, <a href="https://researcher.watson.ibm.com/researcher/view.php?person=us-sanjeebd">Sanjeeb Dash</a>, <a href="https://www.orie.cornell.edu/faculty-directory/oktay-gunluk">Oktay G&uuml;nl&uuml;k</a>, <a href="https://ch.linkedin.com/in/nataliaguricanova?original_referer=https%3A%2F%2Fwww.google.com%2F">Nat&aacute;lia Guri&#269;anov&aacute;</a>, <a href="https://namho-nguyen.github.io">Nam Ho-Nguyen</a>, <a href="https://sites.google.com/site/matroidintersection/">Tony Huynh</a>, <a href="https://www.andrew.cmu.edu/user/fkilinc/">Fatma K&#x131;l&#x131;n&ccedil;-Karzan</a>, <a href="https://www.linkedin.com/in/yeongjong-kim-948390225/?locale=en_US">Yeongjong Kim</a>, <a href="http://users.iems.northwestern.edu/~simge/index.html">Simge K&uuml;&ccedil;&uuml;kyavuz</a>, <a href="https://dimag.ibs.re.kr/home/duksang/">Duksang Lee</a>, <a href="https://krannert.purdue.edu/directory/">Yanjun Li</a>, <a href="https://sorooshafiee.github.io">Soroosh Shafieezadeh-Abadeh</a>, <a href="https://personal.lse.ac.uk/vojnovic/">Milan Vojnovic</a>, <a href="https://fbsqkd.github.io">Se-Young Yun</a></p>

</body>
</html>
</div>
